Repository: CShaprper/ShoolManagerGit
Catalog: SchoolManager/*.lproj/Localizable.strings
Languages: de

# Alert_AddingDisabled_Title
source: Adding Disabled
de: Hinzufügen deaktiviert

# Alert_Error_Title
source: Error
de: Fehler

# Alert_Action_Cancel
source: cancel
de: abbrechen

# Alert_Delete_Title
source: Delete Action
de: Löschaktion

# Alert_Action_Delete
source: delete
de: löschen

# Alert_Action_Edit
source: edit
de: bearbeiten

# Alert_MissingData_Title
source: Missing Input
de: Fehlende Eingabe

# ActionSheet_ElementAction_Title
source: Selected Element Action
de: Augewähltes Element Aktionen

# Hour_Number
source: Hour-no.:
de: Stunde Nr.:

# Alert_WrongUserInput_Title
source: Wrong Input!
de: Unkorrekte Eingabe!

# Alert_GotToSettings
source: go to settings
de: zu den Einstellungen

# RemoveAds
source: RemoveAdsWood
de: RemoveAdsWood_DE

# RateNow
source: RateNowWood
de: RateNowWood_DE

source: open note
de: Notiz öffnen

# MainVC_NowLabelText
source: Now
de: Jetzt

# MainVC_NowRoomLabelText
source: room:
de: Raum:

# MainVC_NextLabelText
source: Next
de: Gleich

# MainVC_NowHourStartLabelText
source: from:
de: von:

# MainVC_NowHourEndLabelText
source: to:
de: bis:

# TimeTableTitleOdd
source: Time Table odd Week
de: Stundenplan gerade Woche

# TimeTableTitleUneven
source: Time Table uneven Week
de: Stundenplan ungerade Woche

# DashboardWelcomeHeader
source: Welcome to School Manager
de: Willkommen bei School Manager

# DashboardWelcomeMessage
source: Almost done! Here you will see your acutal and upcoming school lessons after you have configured your personal 'Time Table'. You first should visit the 'Settings' to configure your 'Time Table'.
de: Fast geschafft! Hier siehst Du in Zukunft Deine aktuelle und nächste Schulstunde. Zuerst solltest Du jedoch den 'Einstellungen' einen Besuch abstatten, um Deinen persönlichen 'Stundenplan' zu konfigurieren.

# EnabledDaysVC_AlertHourDeleteDisabled_Title
source: Delete hour disabled!
de: Deaktiviert!

# EnabledDaysVC_AlertHourDeleteDisabled_MessagePaart1
source: You cannot delete hour
de: Du kannst Stunde

# EnabledDaysVC_AlertHourDeleteDisabled_MessagePaart2
source: . You have set up this hour in your 'Timeline'. If you want to decrease the hours per day. You should first change the 'Timeline' in the settings.
de: nicht löschen. Diese Stunde ist ein Element in Deinem 'Tagesablauf'. Wenn Du den Anzahl der Stunden je Tag verkleinern möchtest, solltest Du zuerst den 'Tagesablauf' in den Einstellungen ändern.

# EnabledDaysVC_AlertDeleteDayDisables_Title
source: Delete action disabled
de: Löschen deaktiviert

# EnabledDaysVC_AlertDeleteDayDisables_Message
source: You cannot remove this day. There are active 'Time Table' elements for this day. Please clear the whole 'Time Table' first to setup a new 'weekly Timeline'
de: Du kannst diesen Tag nicht entfernen. In Deinem 'Stundenplan' gibt es aktive Elemente an diesem Tag. Du solltest erst alle Elemente zu diesem Tag aus dem 'Stundenplan' entfernen um einen neuen Wochenablauf zu erstellen.

# EnabledDaysInfoHeader
source: Enabled Days
de: Verfügbare Tage

# EnabledDaysInfoMessage
source: The first settings you should configure are the 'Enabled Days' that you will see in your personal 'Time Table'. Here you have the chance to configure also the count of hours per day.
de: Zuerst solltest Du die 'Verfügbaren Tage' für Deinen persönlichen 'Stundenplan' einstellen. Hier bekommst Du auch die Möglichkeit die Anzahl der Stunden pro Tag zu konfigurieren.

# TimelineInfoHeader
source: Day Timline
de: Tagesablauf / Zeitplan

# TimelineInfoMessage
source: Next you should design your daily timeline. Set the starttime and endtime for each of your school hours.
de: Als nächstes ist es wichtig Deinen persönlichen Zeitplan zu gestalten. Konfiguriere die Start- und Endzeit für jede Schulstunde.

# TeacherInfoHeader
source: List of Teachers
de: Liste Deiner Lehrer

# TeacherInfoMessage
source: Now you should list all your teachers in the in the 'Teacher Settings' view.
de: Jetzt kannst Du all Deine Lehrer in der nächsten Ansicht speichern.

# SubjectsInfoHeader
source: List of School Subjects
de: Liste Deiner Schulfächer

# SubjectsInfoMessage
source: Almost finished! Save your school subjects at the next view.
de: Fast fertig! Speicher Deine Schulfächer mit Hilfe der nächsten Ansicht.

# TimeTableWelcomeHeader
source: Time Table
de: Stundenplan

# TimeTableWelcomeMessage
source: Great! Now its time to configure your 'Time Table'. Tap on the visible elements to configure. School Manager supports odd and uneven week configuration. Later you can try a long press to switch the 'Time Table' view between odd and uneven week view.
de: Super! Jetzt ist es an der Zeit Deinen Stundenplan zu konfigurieren. Tippe auf die sichtbaren Stundenplan Elemente. School Manager ermöglicht verschiedene Ansichten an geraden und ungeraden Kalenderwochen. Später kannst Du mittels long press zwischen den Ansichten wechseln.

# TeacherTable_TeacherActionSheet_Title
source: Teacher Element action
de: Lehrer Aktion

# TeacherTable_TeacherActionSheet_Message
source: Here you see all possible actions to the selected element. For delete action, you first need to clear your 'Time Table' from elements containing this teacher!
de: Hier siehst Du mögliche Aktionen zum ausgewählten Element. Für eine Löschkation solltest Du zuerst alle Elemente des aktiven 'Stundenplans' mit diesem Lehrer löschen!

# TimelineVC_AlertHourNumberColliding_Message
source: Your hour number still exists. Try a different hour number!
de: Die Stundennummmer existiert bereits. Versuche eine andere Stundennummer!

# TimelineVC_AlertTimePeriodColliding_Message
source: Your input time period overlaps with an existing time period!
de: Die Zeitperiode Deiner Eingabe überschneidet sich mit einer existierenden Zeitperiode!

# TimelineVC_AlertStartTimeSmallerThanEndTime_Message
source: Your startime is smaller than your endtime.
de: Die Startzeit ist kleiner als die Endzeit!

# TimelineVC_ActionSheetTimeTableActions_Message
source: Here you see teh possible actions to the selected element. For delete action you first should delete all 'Time Table' elements containing this hours
de: Hier siehst Du die möglichen Aktionen zum ausgewählten Element. Für eine Löschaktion solltest Du zuerst alle 'Stundenplan' Elemente mit dieser Stunde löschen!

# SubjectsVC_ActionSheetTimeTableActions_Message
source: Here you see the possible actions to the selected element. For delete action you first should to delete all 'Time Table' elements containing this subject.
de: Hier siehst Du die möglichen Aktionen zum ausgewählten Element. Für eine Löschaktion solltest Du zuerst alle 'Stundenplan' Elemente mit diesem Schulfach aus dem 'Stundenplan' entfernen.

# Alert_MissingSubject_Message
source: Enter a subject!
de: Gib ein Schulfach ein!

# Alert_MissingColor_Message
source: Choose a color!
de: Wähle eine Farbe!

# AddNotePlaceholderText
source: Enter your text here ....
de: Gib hier Deine Notiz ein ....

# AddNoteAddNoteText
source: Enter your note text!
de: Gib einen Text zu Deiner Notiz ein!

# PlanerSetup_MissingRoom_Message
source: Enter a room number!
de: Gib eine Raumnummer an!

# PlanerSetup_MissingSubject_Message
source: Select a subject!
de: Wähle ein Schulfach!

# PlanerSetup_MissingTeacher_Message
source: Select a teacher!
de: Wähle einen Lehrer!

# PlanerSetup_MissingHour_Message
source: Select an hour!
de: Wähle eine Stunde!

# PlanerSetup_MissingDay_Message
source: Select a day!
de: Wähle einen Tag!

# PlanerSetup_MissingWeeknumber_Message
source: Select wether your 'Time Table' element should show up on 'odd' - 'uneven' - 'both' weeknumbers!
de: Wähle ob das 'Stundenplan' Element an 'geraden' - 'ungeraden' oder 'beiden' Wochen erscheinen soll!

# PlanerSetup_Hour
source: hour:
de: Stunde:

# PlanerSetup_Hour_Message
source: Hour:
de: Stunde:

# PlanerSetup_HourOnDay_Message
source: on day:
de: am:

# PlanerSetup_HourCollides_Message
source: overlaps with
de: überschneidet sich mit

# PlanerSetup_AtTime_Message
source: at time
de: an Stunde

# PlanerSetup_OnDay_Message
source: on
de: am

# PlanerSetup_RestMessage
source: in your 'Time Table'. Try a different day/hour or delete the existing 'Time Table' element!
de: in Deinem 'Stundenplan'. Versuche einen anderen Tag / eine andere Stunde oder lösche das existtierende 'Stundenplan' Element!

# TimeTableVC_DeleteCompleteTimeTable
source: Do you really want to delete the whole Time Table?
de: Bist Du sicher, dass Du den gesamten Stundenplan löschen möchtest?

# TimeTableVC_DeleteAll
source: delete all
de: alle löschen

# TimeTableVC_AddNote
source: add note to:
de: Notiz hinzufügen zu:

# TimeTableVC_SwitchWeek
source: switch 'Time Table' week view
de: Wochenansicht wechseln

# TimeTableVC_PossibleActions
source: Here you see the possible actions for the selected element!
de: Hier siehst Du die möglichen Aktionen zum ausgewählten Element!

# Alert_WrongReminderDate_Message
source: The reminder date must be a future date!
de: Das Erinnerungsdatum muss in der Zukunft liegen!
